base_files/cylinder_jets/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    cylinder
    {
        type			zeroGradient;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    jet1
	{
        type			zeroGradient;
	}	
	jet2
	{
        type			zeroGradient;
    }
    jet3
	{
        type			zeroGradient;
	}	
    jet4
	{
        type			zeroGradient;
	}
    outlet
    {
        type			zeroGradient;
    }
    cyclic1
    {
        type            cyclic;
    }
    cyclic2
    {
        type            cyclic;
    } 
}


// ************************************************************************* //
