base_files/cylinder_jets/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    cyclic2
    {
        type    cyclic;
        inGroups    1(cyclic);
        neighbourPatch  cyclic1;
        physicalType    patch;
        nFaces          10308;
        startFace       16784;
    }
    cyclic1
    {
        type    cyclic;
        inGroups    1(cyclic);
        neighbourPatch  cyclic2;
        physicalType    patch;
        nFaces          10308;
        startFace       27092;
    }
    cylinder
    {
        type    wall;
        physicalType wall;
        nFaces          148;
        startFace       37400;
    }
    jet4
    {
        type            patch;
        physicalType    patch;
        nFaces          3;
        startFace       37548;
    }
    jet2
    {
        type            patch;
        physicalType    patch;
        nFaces          3;
        startFace       37551;
    }
    jet1
    {
        type            patch;
        physicalType    patch;
        nFaces          3;
        startFace       37554;
    }
    jet3
    {
        type            patch;
        physicalType    patch;
        nFaces          3;
        startFace       37557;
    }
    wall
    {
        type    wall;
        physicalType wall;
        nFaces          178;
        startFace       37560;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          29;
        startFace       37738;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          29;
        startFace       37767;
    }
)

// ************************************************************************* //
